mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xn/common/mb9bf36xn.h
              __IO uint8_t IRQ075MONLH;
            };
          };
          union {
            __IO uint16_t IRQ075MONH;
            struct {
              __IO uint8_t IRQ075MONHL;
              __IO uint8_t IRQ075MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ076MON;
        stc_intreq_irq076mon_field_t IRQ076MON_f;
        struct {
          union {
            __IO uint16_t IRQ076MONL;
            struct {
              __IO uint8_t IRQ076MONLL;
              __IO uint8_t IRQ076MONLH;
            };
          };
          union {
            __IO uint16_t IRQ076MONH;
            struct {
              __IO uint8_t IRQ076MONHL;
              __IO uint8_t IRQ076MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ077MON;
        stc_intreq_irq077mon_field_t IRQ077MON_f;
        struct {
          union {
            __IO uint16_t IRQ077MONL;
            struct {
              __IO uint8_t IRQ077MONLL;
              __IO uint8_t IRQ077MONLH;
            };
          };
          union {
            __IO uint16_t IRQ077MONH;
            struct {
              __IO uint8_t IRQ077MONHL;
              __IO uint8_t IRQ077MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ078MON;
        stc_intreq_irq078mon_field_t IRQ078MON_f;
        struct {
          union {
            __IO uint16_t IRQ078MONL;
            struct {
              __IO uint8_t IRQ078MONLL;
              __IO uint8_t IRQ078MONLH;
            };
          };
          union {
            __IO uint16_t IRQ078MONH;
            struct {
              __IO uint8_t IRQ078MONHL;
              __IO uint8_t IRQ078MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ079MON;
        stc_intreq_irq079mon_field_t IRQ079MON_f;
        struct {
          union {
            __IO uint16_t IRQ079MONL;
            struct {
              __IO uint8_t IRQ079MONLL;
              __IO uint8_t IRQ079MONLH;
            };
          };
          union {
            __IO uint16_t IRQ079MONH;
            struct {
              __IO uint8_t IRQ079MONHL;
              __IO uint8_t IRQ079MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ080MON;
        stc_intreq_irq080mon_field_t IRQ080MON_f;
        struct {
          union {
            __IO uint16_t IRQ080MONL;
            struct {
              __IO uint8_t IRQ080MONLL;
              __IO uint8_t IRQ080MONLH;
            };
          };
          union {
            __IO uint16_t IRQ080MONH;
            struct {
              __IO uint8_t IRQ080MONHL;
              __IO uint8_t IRQ080MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ081MON;
        stc_intreq_irq081mon_field_t IRQ081MON_f;
        struct {
          union {
            __IO uint16_t IRQ081MONL;
            struct {
              __IO uint8_t IRQ081MONLL;
              __IO uint8_t IRQ081MONLH;
            };
          };
          union {
            __IO uint16_t IRQ081MONH;
            struct {
              __IO uint8_t IRQ081MONHL;
              __IO uint8_t IRQ081MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ082MON;
        stc_intreq_irq082mon_field_t IRQ082MON_f;
        struct {
          union {
            __IO uint16_t IRQ082MONL;
            struct {
              __IO uint8_t IRQ082MONLL;
              __IO uint8_t IRQ082MONLH;
            };
          };
          union {
            __IO uint16_t IRQ082MONH;
            struct {
              __IO uint8_t IRQ082MONHL;
              __IO uint8_t IRQ082MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ083MON;
        stc_intreq_irq083mon_field_t IRQ083MON_f;
        struct {
          union {
            __IO uint16_t IRQ083MONL;
            struct {
              __IO uint8_t IRQ083MONLL;
              __IO uint8_t IRQ083MONLH;
            };
          };
          union {
            __IO uint16_t IRQ083MONH;
            struct {
              __IO uint8_t IRQ083MONHL;
              __IO uint8_t IRQ083MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ084MON;
        stc_intreq_irq084mon_field_t IRQ084MON_f;
        struct {
          union {
            __IO uint16_t IRQ084MONL;
            struct {
              __IO uint8_t IRQ084MONLL;
              __IO uint8_t IRQ084MONLH;
            };
          };
          union {
            __IO uint16_t IRQ084MONH;
            struct {
              __IO uint8_t IRQ084MONHL;
              __IO uint8_t IRQ084MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ085MON;
        stc_intreq_irq085mon_field_t IRQ085MON_f;
        struct {
          union {
            __IO uint16_t IRQ085MONL;
            struct {
              __IO uint8_t IRQ085MONLL;
              __IO uint8_t IRQ085MONLH;
            };
          };
          union {
            __IO uint16_t IRQ085MONH;
            struct {
              __IO uint8_t IRQ085MONHL;
              __IO uint8_t IRQ085MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ086MON;
        stc_intreq_irq086mon_field_t IRQ086MON_f;
        struct {
          union {
            __IO uint16_t IRQ086MONL;
            struct {
              __IO uint8_t IRQ086MONLL;
              __IO uint8_t IRQ086MONLH;
            };
          };
          union {
            __IO uint16_t IRQ086MONH;
            struct {
              __IO uint8_t IRQ086MONHL;
              __IO uint8_t IRQ086MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ087MON;
        stc_intreq_irq087mon_field_t IRQ087MON_f;
        struct {
          union {
            __IO uint16_t IRQ087MONL;
            struct {
              __IO uint8_t IRQ087MONLL;
              __IO uint8_t IRQ087MONLH;
            };
          };
          union {
            __IO uint16_t IRQ087MONH;
            struct {
              __IO uint8_t IRQ087MONHL;
              __IO uint8_t IRQ087MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ088MON;
        stc_intreq_irq088mon_field_t IRQ088MON_f;
        struct {
          union {
            __IO uint16_t IRQ088MONL;
            struct {
              __IO uint8_t IRQ088MONLL;
              __IO uint8_t IRQ088MONLH;
            };
          };
          union {
            __IO uint16_t IRQ088MONH;
            struct {
              __IO uint8_t IRQ088MONHL;
              __IO uint8_t IRQ088MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ089MON;
        stc_intreq_irq089mon_field_t IRQ089MON_f;
        struct {
          union {
            __IO uint16_t IRQ089MONL;
            struct {
              __IO uint8_t IRQ089MONLL;
              __IO uint8_t IRQ089MONLH;
            };
          };
          union {
            __IO uint16_t IRQ089MONH;
            struct {
              __IO uint8_t IRQ089MONHL;
              __IO uint8_t IRQ089MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ090MON;
        stc_intreq_irq090mon_field_t IRQ090MON_f;
        struct {
          union {
            __IO uint16_t IRQ090MONL;
            struct {
              __IO uint8_t IRQ090MONLL;
              __IO uint8_t IRQ090MONLH;
            };
          };
          union {
            __IO uint16_t IRQ090MONH;
            struct {
              __IO uint8_t IRQ090MONHL;
              __IO uint8_t IRQ090MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ091MON;
        stc_intreq_irq091mon_field_t IRQ091MON_f;
        struct {
          union {
            __IO uint16_t IRQ091MONL;
            struct {
              __IO uint8_t IRQ091MONLL;
              __IO uint8_t IRQ091MONLH;
            };
          };
          union {
            __IO uint16_t IRQ091MONH;
            struct {
              __IO uint8_t IRQ091MONHL;
              __IO uint8_t IRQ091MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ092MON;
        stc_intreq_irq092mon_field_t IRQ092MON_f;
        struct {
          union {
            __IO uint16_t IRQ092MONL;
            struct {
              __IO uint8_t IRQ092MONLL;
              __IO uint8_t IRQ092MONLH;
            };
          };
          union {
            __IO uint16_t IRQ092MONH;
            struct {
              __IO uint8_t IRQ092MONHL;
              __IO uint8_t IRQ092MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ093MON;
        stc_intreq_irq093mon_field_t IRQ093MON_f;
        struct {
          union {
            __IO uint16_t IRQ093MONL;
            struct {
              __IO uint8_t IRQ093MONLL;
              __IO uint8_t IRQ093MONLH;
            };
          };
          union {
            __IO uint16_t IRQ093MONH;
            struct {
              __IO uint8_t IRQ093MONHL;
              __IO uint8_t IRQ093MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ094MON;
        stc_intreq_irq094mon_field_t IRQ094MON_f;
        struct {
          union {
            __IO uint16_t IRQ094MONL;
            struct {
              __IO uint8_t IRQ094MONLL;
              __IO uint8_t IRQ094MONLH;
            };
          };
          union {
            __IO uint16_t IRQ094MONH;
            struct {
              __IO uint8_t IRQ094MONHL;
              __IO uint8_t IRQ094MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ095MON;
        stc_intreq_irq095mon_field_t IRQ095MON_f;
        struct {
          union {
            __IO uint16_t IRQ095MONL;
            struct {
              __IO uint8_t IRQ095MONLL;
              __IO uint8_t IRQ095MONLH;
            };
          };
          union {
            __IO uint16_t IRQ095MONH;
            struct {
              __IO uint8_t IRQ095MONHL;
              __IO uint8_t IRQ095MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ096MON;
        stc_intreq_irq096mon_field_t IRQ096MON_f;
        struct {
          union {
            __IO uint16_t IRQ096MONL;
            struct {
              __IO uint8_t IRQ096MONLL;
              __IO uint8_t IRQ096MONLH;
            };
          };
          union {
            __IO uint16_t IRQ096MONH;
            struct {
              __IO uint8_t IRQ096MONHL;
              __IO uint8_t IRQ096MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ097MON;
        stc_intreq_irq097mon_field_t IRQ097MON_f;
        struct {
          union {
            __IO uint16_t IRQ097MONL;
            struct {
              __IO uint8_t IRQ097MONLL;
              __IO uint8_t IRQ097MONLH;
            };
          };
          union {
            __IO uint16_t IRQ097MONH;
            struct {
              __IO uint8_t IRQ097MONHL;
              __IO uint8_t IRQ097MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ098MON;
        stc_intreq_irq098mon_field_t IRQ098MON_f;
        struct {
          union {
            __IO uint16_t IRQ098MONL;
            struct {
              __IO uint8_t IRQ098MONLL;
              __IO uint8_t IRQ098MONLH;
            };
          };
          union {
            __IO uint16_t IRQ098MONH;
            struct {
              __IO uint8_t IRQ098MONHL;
              __IO uint8_t IRQ098MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ099MON;
        stc_intreq_irq099mon_field_t IRQ099MON_f;
        struct {
          union {
            __IO uint16_t IRQ099MONL;
            struct {
              __IO uint8_t IRQ099MONLL;
              __IO uint8_t IRQ099MONLH;
            };
          };
          union {
            __IO uint16_t IRQ099MONH;
            struct {
              __IO uint8_t IRQ099MONHL;
              __IO uint8_t IRQ099MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ100MON;
        stc_intreq_irq100mon_field_t IRQ100MON_f;
        struct {
          union {
            __IO uint16_t IRQ100MONL;
            struct {
              __IO uint8_t IRQ100MONLL;
              __IO uint8_t IRQ100MONLH;
            };
          };
          union {
            __IO uint16_t IRQ100MONH;
            struct {
              __IO uint8_t IRQ100MONHL;
              __IO uint8_t IRQ100MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ101MON;
        stc_intreq_irq101mon_field_t IRQ101MON_f;
        struct {
          union {
            __IO uint16_t IRQ101MONL;
            struct {
              __IO uint8_t IRQ101MONLL;
              __IO uint8_t IRQ101MONLH;
            };
          };
          union {
            __IO uint16_t IRQ101MONH;
            struct {
              __IO uint8_t IRQ101MONHL;
              __IO uint8_t IRQ101MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ102MON;
        stc_intreq_irq102mon_field_t IRQ102MON_f;
        struct {
          union {
            __IO uint16_t IRQ102MONL;
            struct {
              __IO uint8_t IRQ102MONLL;
              __IO uint8_t IRQ102MONLH;
            };
          };
          union {
            __IO uint16_t IRQ102MONH;
            struct {
              __IO uint8_t IRQ102MONHL;
              __IO uint8_t IRQ102MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ103MON;
        stc_intreq_irq103mon_field_t IRQ103MON_f;
        struct {
          union {
            __IO uint16_t IRQ103MONL;
            struct {
              __IO uint8_t IRQ103MONLL;
              __IO uint8_t IRQ103MONLH;
            };
          };
          union {
            __IO uint16_t IRQ103MONH;
            struct {
              __IO uint8_t IRQ103MONHL;
              __IO uint8_t IRQ103MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ104MON;
        stc_intreq_irq104mon_field_t IRQ104MON_f;
        struct {
          union {
            __IO uint16_t IRQ104MONL;
            struct {
              __IO uint8_t IRQ104MONLL;
              __IO uint8_t IRQ104MONLH;
            };
          };
          union {
            __IO uint16_t IRQ104MONH;
            struct {
              __IO uint8_t IRQ104MONHL;
              __IO uint8_t IRQ104MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ105MON;
        stc_intreq_irq105mon_field_t IRQ105MON_f;
        struct {
          union {
            __IO uint16_t IRQ105MONL;
            struct {
              __IO uint8_t IRQ105MONLL;
              __IO uint8_t IRQ105MONLH;
            };
          };
          union {
            __IO uint16_t IRQ105MONH;
            struct {
              __IO uint8_t IRQ105MONHL;
              __IO uint8_t IRQ105MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ106MON;
        stc_intreq_irq106mon_field_t IRQ106MON_f;
        struct {
          union {
            __IO uint16_t IRQ106MONL;
            struct {
              __IO uint8_t IRQ106MONLL;
              __IO uint8_t IRQ106MONLH;
            };
          };
          union {
            __IO uint16_t IRQ106MONH;
            struct {
              __IO uint8_t IRQ106MONHL;
              __IO uint8_t IRQ106MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ107MON;
        stc_intreq_irq107mon_field_t IRQ107MON_f;
        struct {
          union {
            __IO uint16_t IRQ107MONL;
            struct {
              __IO uint8_t IRQ107MONLL;
              __IO uint8_t IRQ107MONLH;
            };
          };
          union {
            __IO uint16_t IRQ107MONH;
            struct {
              __IO uint8_t IRQ107MONHL;
              __IO uint8_t IRQ107MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ108MON;
        stc_intreq_irq108mon_field_t IRQ108MON_f;
        struct {
          union {
            __IO uint16_t IRQ108MONL;
            struct {
              __IO uint8_t IRQ108MONLL;
              __IO uint8_t IRQ108MONLH;
            };
          };
          union {
            __IO uint16_t IRQ108MONH;
            struct {
              __IO uint8_t IRQ108MONHL;
              __IO uint8_t IRQ108MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ109MON;
        stc_intreq_irq109mon_field_t IRQ109MON_f;
        struct {
          union {
            __IO uint16_t IRQ109MONL;
            struct {
              __IO uint8_t IRQ109MONLL;
              __IO uint8_t IRQ109MONLH;
            };
          };
          union {
            __IO uint16_t IRQ109MONH;
            struct {
              __IO uint8_t IRQ109MONHL;
              __IO uint8_t IRQ109MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ110MON;
        stc_intreq_irq110mon_field_t IRQ110MON_f;
        struct {
          union {
            __IO uint16_t IRQ110MONL;
            struct {
              __IO uint8_t IRQ110MONLL;
              __IO uint8_t IRQ110MONLH;
            };
          };
          union {
            __IO uint16_t IRQ110MONH;
            struct {
              __IO uint8_t IRQ110MONHL;
              __IO uint8_t IRQ110MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ111MON;
        stc_intreq_irq111mon_field_t IRQ111MON_f;
        struct {
          union {
            __IO uint16_t IRQ111MONL;
            struct {
              __IO uint8_t IRQ111MONLL;
              __IO uint8_t IRQ111MONLH;
            };
          };
          union {
            __IO uint16_t IRQ111MONH;
            struct {
              __IO uint8_t IRQ111MONHL;
              __IO uint8_t IRQ111MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ112MON;
        struct {
          union {
            __IO uint16_t IRQ112MONL;
            struct {
              __IO uint8_t IRQ112MONLL;
              __IO uint8_t IRQ112MONLH;
            };
          };
          union {
            __IO uint16_t IRQ112MONH;
            struct {
              __IO uint8_t IRQ112MONHL;
              __IO uint8_t IRQ112MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ113MON;
        stc_intreq_irq113mon_field_t IRQ113MON_f;
        struct {
          union {
            __IO uint16_t IRQ113MONL;
            struct {
              __IO uint8_t IRQ113MONLL;
              __IO uint8_t IRQ113MONLH;
            };
          };
          union {
            __IO uint16_t IRQ113MONH;
            struct {
              __IO uint8_t IRQ113MONHL;
              __IO uint8_t IRQ113MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ114MON;
        stc_intreq_irq114mon_field_t IRQ114MON_f;
        struct {
          union {
            __IO uint16_t IRQ114MONL;
            struct {
              __IO uint8_t IRQ114MONLL;
              __IO uint8_t IRQ114MONLH;
            };
          };
          union {
            __IO uint16_t IRQ114MONH;
            struct {
              __IO uint8_t IRQ114MONHL;
              __IO uint8_t IRQ114MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ115MON;
        struct {
          union {
            __IO uint16_t IRQ115MONL;
            struct {
              __IO uint8_t IRQ115MONLL;
              __IO uint8_t IRQ115MONLH;
            };
          };
          union {
            __IO uint16_t IRQ115MONH;
            struct {
              __IO uint8_t IRQ115MONHL;
              __IO uint8_t IRQ115MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ116MON;
        struct {
          union {
            __IO uint16_t IRQ116MONL;
            struct {
              __IO uint8_t IRQ116MONLL;
              __IO uint8_t IRQ116MONLH;
            };
          };
          union {
            __IO uint16_t IRQ116MONH;
            struct {
              __IO uint8_t IRQ116MONHL;
              __IO uint8_t IRQ116MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ117MON;
        struct {
          union {
            __IO uint16_t IRQ117MONL;
            struct {
              __IO uint8_t IRQ117MONLL;
              __IO uint8_t IRQ117MONLH;
            };
          };
          union {
            __IO uint16_t IRQ117MONH;
            struct {
              __IO uint8_t IRQ117MONHL;
              __IO uint8_t IRQ117MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ118MON;
        stc_intreq_irq118mon_field_t IRQ118MON_f;
        struct {
          union {
            __IO uint16_t IRQ118MONL;
            struct {
              __IO uint8_t IRQ118MONLL;
              __IO uint8_t IRQ118MONLH;
            };
          };
          union {
            __IO uint16_t IRQ118MONH;
            struct {
              __IO uint8_t IRQ118MONHL;
              __IO uint8_t IRQ118MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ119MON;
        stc_intreq_irq119mon_field_t IRQ119MON_f;
        struct {
          union {
            __IO uint16_t IRQ119MONL;
            struct {
              __IO uint8_t IRQ119MONLL;
              __IO uint8_t IRQ119MONLH;
            };
          };
          union {
            __IO uint16_t IRQ119MONH;
            struct {
              __IO uint8_t IRQ119MONHL;
              __IO uint8_t IRQ119MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ120MON;
        stc_intreq_irq120mon_field_t IRQ120MON_f;
        struct {
          union {
            __IO uint16_t IRQ120MONL;
            struct {
              __IO uint8_t IRQ120MONLL;
              __IO uint8_t IRQ120MONLH;
            };
          };
          union {
            __IO uint16_t IRQ120MONH;
            struct {
              __IO uint8_t IRQ120MONHL;
              __IO uint8_t IRQ120MONHH;
            };
          };
        };
    };
    union {
        __IO uint32_t IRQ121MON;
        stc_intreq_irq121mon_field_t IRQ121MON_f;
        struct {
          union {
            __IO uint16_t IRQ121MONL;
            struct {
              __IO uint8_t IRQ121MONLL;
              __IO uint8_t IRQ121MONLH;
            };
          };
          union {
            __IO uint16_t IRQ121MONH;
            struct {
              __IO uint8_t IRQ121MONHL;
              __IO uint8_t IRQ121MONHH;
            };
          };
        };
    };
